app/views/users/_form.html.erb

SELECT "saloons".* FROM "saloons"
---
    <%= f.label :saloon_id, "Which Saloon do you belong to?" %>
    <%= f.collection_select :saloon_id, Saloon.all, :id, :name %>