app/views/users/show.html.erb

SELECT  "saloons".* FROM "saloons" WHERE "saloons"."id" = ? LIMIT 1  [["id", nil]]
---
  <strong>Saloon:</strong>
  <%= link_to Saloon.find(@user.saloon_id).name, Saloon.find(@user.saloon_id)  %>