app/controllers/saloons_controller.rb

SELECT "saloons".* FROM "saloons"
---
  def index
    @search = Saloon.search(params[:q])

INSERT INTO "saloons" ("name", "image", "description", "tel_number", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @saloon = Saloon.new(saloon_params)

    respond_to do |format|
      if @saloon.save

UPDATE "saloons" SET "description" = ?, "updated_at" = ? WHERE "saloons"."id" = ?  [["description", "BarbersLadies Hairdressers, Wet & Dry CutsWet Shaves, Colours, Cuts & Blow Dry, Unisex Salon"], ["updated_at", "2015-08-06 00:24:58.310019"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @saloon.update(saloon_params)

DELETE FROM "saloons" WHERE "saloons"."id" = ?  [["id", 2]]
---
  def destroy
    @saloon.destroy

SELECT  "saloons".* FROM "saloons" WHERE "saloons"."id" = ? LIMIT 1  [["id", 1]]
---
  def upvote
    @saloon = Saloon.find(params[:id])

SELECT  "saloons".* FROM "saloons" WHERE "saloons"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_saloon
      @saloon = Saloon.find(params[:id])