app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
   @user = User.new user_params
   if @user.save

UPDATE "users" SET "password_digest" = ?, "saloon_id" = ?, "location" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$GSTtqGEzGVEKpquKnZMSBeT7ijB.iC7HvKs6yMdhDuSAO9WRhVQge"], ["saloon_id", 1], ["location", "Camden"], ["updated_at", "2015-08-04 15:14:31.674020"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)